app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "first_name" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["first_name", "Coldy"], ["updated_at", "2019-04-02 17:26:12.324546"], ["id", 3]]